First, import the libraries that we will be using in this tutorial and check the versions.

In [1]:
%matplotlib inline
import sys
import pandas as pd
import numpy as np
import matplotlib as matplt
import matplotlib.pyplot as plt

print('Python version ' + sys.version)
print('Numpy version ' + np.__version__)
print('Pandas version ' + pd.__version__)
print('Matplotlib version ' + matplt.__version__)

Python version 3.6.0 |Anaconda custom (x86_64)| (default, Dec 23 2016, 13:19:00)
[GCC 4.2.1 Compatible Apple LLVM 6.0 (clang-600.0.57)]
Numpy version 1.11.3
Pandas version 0.19.2
Matplotlib version 2.0.0

Create a dataframe from a toy dataset and it df

In [2]:
data = {'name': ['Mr. Jason', 'Molly', 'Ms. Tina', 'Jake', 'Amy'], 
        'age': [42, 52, 36, 24, 50],    
        }
df = pd.DataFrame(data, columns = ['name', 'age'])
df

        name  age
0  Mr. Jason   42
1      Molly   52
2   Ms. Tina   36
3       Jake   24
4        Amy   50

3- General information about the dataframe

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
name    5 non-null object
age     5 non-null int64
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

4- Some statistic about the dataframe

In [4]:
df.describe()

             age
count   5.000000
mean   40.800000
std    11.366618
min    24.000000
25%    36.000000
50%    42.000000
75%    50.000000
max    52.000000

5- Select a column

In [5]:
# One square bracket returns pandas series. 
df['age']

0    42
1    52
2    36
3    24
4    50
Name: age, dtype: int64

In [6]:
# Two square brackets returns pandas dataframe. 
df[['age']]

   age
0   42
1   52
2   36
3   24
4   50

6- Select multiple columns

In [7]:
# in this case double square bracket is mendotary.
df[['name', 'age']]

        name  age
0  Mr. Jason   42
1      Molly   52
2   Ms. Tina   36
3       Jake   24
4        Amy   50

7- Select a row

In [8]:
#select certain rows 
df.take([0, 3])

        name  age
0  Mr. Jason   42
3       Jake   24

In [9]:
df[1:2]

    name  age
1  Molly   52

In [10]:
df[1:3]

       name  age
1     Molly   52
2  Ms. Tina   36

In [11]:
# use loc to query by index label 
df.loc[0]

name    Mr. Jason
age            42
Name: 0, dtype: object

In [12]:
# use iloc to query by numeric location
df.iloc[0]

name    Mr. Jason
age            42
Name: 0, dtype: object

To understand the loc and iloc better. Let's change the index of dataframe.

In [13]:
df2 = df.set_index('name')
df2

           age
name
Mr. Jason   42
Molly       52
Ms. Tina    36
Jake        24
Amy         50

In [14]:
df2.loc['Mr. Jason']

age    42
Name: Mr. Jason, dtype: int64

In [15]:
df2.iloc[0]

age    42
Name: Mr. Jason, dtype: int64

8- Add a new column

In [16]:
# you have to enter a value for each row.
df['date'] = ['02-02-2012', 'May 1', '2014-03-05', 'December 2', '3-3-2002']
df

        name  age        date
0  Mr. Jason   42  02-02-2012
1      Molly   52       May 1
2   Ms. Tina   36  2014-03-05
3       Jake   24  December 2
4        Amy   50    3-3-2002

In [17]:
#use index values to add value for the new column. Pandas puts NaN for you.
df['gender'] = pd.Series({0:'Male', 1:'Female', 4:'Female'})
df

        name  age        date  gender
0  Mr. Jason   42  02-02-2012    Male
1      Molly   52       May 1  Female
2   Ms. Tina   36  2014-03-05     NaN
3       Jake   24  December 2     NaN
4        Amy   50    3-3-2002  Female

9- Merging DataFrames

In [18]:
# create a second dataframe 
data = {'name': [ 'Kelly', 'Ms. Tina', 'Jake', 'Kyle'], 
        'job': ['Lawyer', 'Nurse', 'Engineer', 'Doctor'],
        'sex':['Male','Female','Male','Female'],
        }
dfB = pd.DataFrame(data, columns = ['name', 'job', 'sex'])
print (dfB)
print ()
print(df)

       name       job     sex
0     Kelly    Lawyer    Male
1  Ms. Tina     Nurse  Female
2      Jake  Engineer    Male
3      Kyle    Doctor  Female

        name  age        date  gender
0  Mr. Jason   42  02-02-2012    Male
1      Molly   52       May 1  Female
2   Ms. Tina   36  2014-03-05     NaN
3       Jake   24  December 2     NaN
4        Amy   50    3-3-2002  Female

In [19]:
# union all rows in the dataframe
pd.merge(df, dfB, how='outer')

        name   age        date  gender       job     sex
0  Mr. Jason  42.0  02-02-2012    Male       NaN     NaN
1      Molly  52.0       May 1  Female       NaN     NaN
2   Ms. Tina  36.0  2014-03-05     NaN     Nurse  Female
3       Jake  24.0  December 2     NaN  Engineer    Male
4        Amy  50.0    3-3-2002  Female       NaN     NaN
5      Kelly   NaN         NaN     NaN    Lawyer    Male
6       Kyle   NaN         NaN     NaN    Doctor  Female

In [20]:
#intersection of dataframes
pd.merge(df, dfB, how='inner')

       name  age        date gender       job     sex
0  Ms. Tina   36  2014-03-05    NaN     Nurse  Female
1      Jake   24  December 2    NaN  Engineer    Male

In [21]:
pd.merge(df, dfB, how='left')

        name  age        date  gender       job     sex
0  Mr. Jason   42  02-02-2012    Male       NaN     NaN
1      Molly   52       May 1  Female       NaN     NaN
2   Ms. Tina   36  2014-03-05     NaN     Nurse  Female
3       Jake   24  December 2     NaN  Engineer    Male
4        Amy   50    3-3-2002  Female       NaN     NaN

In [22]:
# we can choose columns to join dataframes
pd.merge(df, dfB, how='inner', left_on='name', right_on='name')

       name  age        date gender       job     sex
0  Ms. Tina   36  2014-03-05    NaN     Nurse  Female
1      Jake   24  December 2    NaN  Engineer    Male

In [23]:
#index for df is 0-4 and 0-3 for dfB
# since we merged dataframes on indicies pandas recognized there are 2 name columns. it has
#named those name_x and name_y. same as gedeer_x and gender_y
#_x is the information of left dataframe, _y is for the right
pd.merge(df, dfB, how='outer', left_index=True, right_index=True)

      name_x  age        date  gender    name_y       job     sex
0  Mr. Jason   42  02-02-2012    Male     Kelly    Lawyer    Male
1      Molly   52       May 1  Female  Ms. Tina     Nurse  Female
2   Ms. Tina   36  2014-03-05     NaN      Jake  Engineer    Male
3       Jake   24  December 2     NaN      Kyle    Doctor  Female
4        Amy   50    3-3-2002  Female       NaN       NaN     NaN

In [24]:
#merge dataframes on a common column
pd.merge(df, dfB, how= 'inner', on='name')

       name  age        date gender       job     sex
0  Ms. Tina   36  2014-03-05    NaN     Nurse  Female
1      Jake   24  December 2    NaN  Engineer    Male

Pandorable writing code

In [25]:
(df.where(df['age'] > 25)
   .set_index('name')
   .rename(columns={'gender' : 'sex'})
)

            age        date     sex
name
Mr. Jason  42.0  02-02-2012    Male
Molly      52.0       May 1  Female
Ms. Tina   36.0  2014-03-05     NaN
NaN         NaN         NaN     NaN
Amy        50.0    3-3-2002  Female

#### apply function
takes the function and the axis on which to operate as parameters

In [26]:
def gender(value):
    if value == 'Male':
        return 'M'
    elif value == 'Female':
        return 'F'
    else :
        return 'Unknown'

In [27]:
df['genderCoded'] = df['gender'].apply(gender)

In [28]:
df

        name  age        date  gender genderCoded
0  Mr. Jason   42  02-02-2012    Male           M
1      Molly   52       May 1  Female           F
2   Ms. Tina   36  2014-03-05     NaN     Unknown
3       Jake   24  December 2     NaN     Unknown
4        Amy   50    3-3-2002  Female           F

### using lambda

In [29]:
df['status'] = df['age'].apply(lambda x: 'old' if x > 25 else 'young' )
df

        name  age        date  gender genderCoded status
0  Mr. Jason   42  02-02-2012    Male           M    old
1      Molly   52       May 1  Female           F    old
2   Ms. Tina   36  2014-03-05     NaN     Unknown    old
3       Jake   24  December 2     NaN     Unknown  young
4        Amy   50    3-3-2002  Female           F    old

### Group by

In [30]:
df

        name  age        date  gender genderCoded status
0  Mr. Jason   42  02-02-2012    Male           M    old
1      Molly   52       May 1  Female           F    old
2   Ms. Tina   36  2014-03-05     NaN     Unknown    old
3       Jake   24  December 2     NaN     Unknown  young
4        Amy   50    3-3-2002  Female           F    old

In [31]:
# find the average age of persons by gender
df.groupby('gender').agg(np.average)

        age
gender
Female   51
Male     42

In [32]:
# using for loop 
for group, frame in df.groupby('gender'):
    avg = np.average(frame['age'])
    print('Average of age ' + group + ' is ' + str(avg))

Average of age Female is 51.0
Average of age Male is 42.0

In [33]:
# use aggregate function in group by
df.groupby('gender').agg({'age': np.average})

        age
gender
Female   51
Male     42

In [34]:
df.groupby('gender').agg({'age': np.sum})

        age
gender
Female  102
Male     42

In [35]:
#or 
df.groupby('gender').agg(sum)

        age
gender
Female  102
Male     42

In [36]:
# multiple stats in a group by
df.groupby('gender').agg({np.sum, np.mean, np.std, np.min, np.max,})

        age
       amin  sum mean amax       std
gender
Female   50  102   51   52  1.414214
Male     42   42   42   42       NaN

-Change the index

In [37]:
df['age'].mean() , df.age.mean()

(40.8, 40.8)